#include <stdio.h> 
#include <stdlib.h> 

int main ()
{
    // 顯示 ASCII 圖案
    puts("           =:                                                                                :=***=:         ");
    puts("           **                                                                              :*#%#####*-       ");
    puts("           +%.                               .                                            :#%%%=--+###+.     ");
    puts("           +#-              :+             :*#*.                                         .*%%#-    .-+##:    ");
    puts("           +#*              =#:          -*#%%%+                                         +#%#+        :##.   ");
    puts("          .*##              =%-        -##+-*##*                                        .#%%%.       .%%%:   ");
    puts("          .###.             +#=        -:   *#%#.                                       -#%#*       :%@@@%.  ");
    puts("          -###.             +##.            +#%#:                                       -#%#*      =%@@@@=   ");
    puts("          =#%#.            .*##:            =#%%-                                       .####*===+%%@@@@#.   ");
    puts("          +%%#            .:##%-            =%%%=                                        :*####%%##%@@@@=    ");
    puts("         .#%%*      .-=*###%%%%=            -#%#+                           .==+++-.       -+#####**%%%%:    ");
    puts("         -#%#=.:-=*#########%%%+            -#%##                          -#@%%%%##*:             +%%%%     ");
    puts("         +#%%####**+++=--::-#%%*            -#%##                         .#@@%%%%%%%#*:           *%%@#     ");
    puts("        .*%##.             .#%%*            -####                          *@%*. :+%%%##-          #%%@+     ");
    puts("        -###*              :#%%*            -####                         .#%=     .*%%##-        .%%%@-     ");
    puts("        =#%#=              -#%#+            -####                         .###       *%%#*.       -%%%@:     ");
    puts("        *#%#-              =#%#+            -####.                        .*##-      .%###:       =%%%%:     ");
    puts("        ###%:              +#%#=            -###%.                         +###:     +####.       -%%%@:     ");
    puts("       :####.              ##%#-            :###%:                         :##%+    =####-        -%@%@:     ");
    puts("       =#%##               ###%-            :###%:                          +#%%*-:+####-         =%%%%.     ");
    puts("       *#%%=               *###-            :##%%--+=:                       =#%%%%%%##-          +%%%%      ");
    puts("      -##%%.               *#%#=            .##@@%###=.        +##=           :+####*=.           *%%%#      ");
    puts("      *#%%*                ##%%+            .#%@@%#*+:        -%%%%-             ...              *%%%*      ");
    puts("      -=*#:                #%%%+          .-+%%%#+:           .+**=                               #%%%*      ");
    puts("        ..                 =#%*-        .+#*+=:..                                                 #%%%*      ");
    puts("                           :-.                                                                    #%%%*      ");
    puts("                                                                                                  #%%%*      ");
    puts("                                                                                                  #%%%#      ");
    puts("                                                                                                  *#%#%      ");
    puts("                                                                                                  +%%#%.     ");
    puts("                                                                                                  +%%#%.     ");
    puts("                                                                                                  -*%%#.     ");
    puts("                                                                                                   -=:.      ");
    
    system("pause");  // 暫停程式，等待使用者輸入
    system("CLS");    // 清除螢幕
    
    // 密碼驗證
    int a, b, c, d;
    printf("請輸入四個數字的密碼:\n");
    scanf("%d %d %d %d", &a, &b, &c, &d);
    
    if ((a == 2) && (b == 0) && (c == 2) && (d == 4)) {
        printf("歡迎\n");
    } else {
        printf("ERROR\a\n"); // 錯誤時發出警示音
        return 0;
    }
    
    system("pause");  // 再次暫停
    system("CLS");    // 再次清除螢幕
    fflush(stdin); //清除緩衝區空間 
    
    // 顯示字元對應的類別
    puts(" -------------------------- ");
    puts("| 'A'...'Z'  : Uppercase   |");
    puts("| 'a'...'z'  : Lowercase   |");
    puts("| '0'...'9'  : Digit       |");
    puts("|  Otherwise : Your name   |");
    puts(" -------------------------- ");
    
    char ch;
    printf("請輸入一個字元:\n");
    ch = getchar();  // 讀取單個字元

    if (ch >= '0' && ch <= '9')  
        printf("Digit\n");
    else if (ch >= 'A' && ch <= 'Z')   
            printf("Uppercase\n");
         else if (ch >= 'a' && ch <= 'z')  
                 printf("Lowercase\n");
              else   
                     printf("H1.09 黃永賢\n");  

    return 0;

    system("pause");  // 最後暫停
    return 0;
}
/*心得與討論:

這次的作業讓我收穫頗多。在處理單一字符輸入時，使用getchar()更加簡潔且直觀；而在需要處理多個輸入時， 
則scanf()顯得更加靈活。不過，需要特別注意的是，像空格或 Enter 這類輸入可能會導致記憶體中存儲錯誤的
訊息。為了避免這類問題，可以在格式字串之資料型態的前後加上空格，以確保輸入處理的正確性，還有注意在
輸入新的字元時，要清除緩衝區資料以避免記憶體讀取錯誤的字元。在設計個人介面的過程中，我運用了手寫板
在電腦小畫家中完成設計，並將生成的圖片轉換為 ASCII 碼。以上的方法，不僅讓成果更加多元且美觀，也讓
我學會靈活應用所學的語法和電腦的基本功能，這無疑大幅提升了程式作業的品質。*/
